evidencias/cenario-a-cold-start/Teste Controlado (Cold Start & Isolamento) Rest.txt
Teste Controlado (Cold Start & Isolamento) Rest 

PS C:\ProjetosGit\tcc\tcc-api-performance> docker run --rm -i -v "${PWD}:/repo" -w /repo/k6 -e BASE_URL=http://host.docker.internal:8085 grafana/k6 run test-rest.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-rest.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 11 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 02/10 VUs, 77 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  02.0s/50.0s

running (0m03.0s), 03/10 VUs, 162 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  03.0s/50.0s

running (0m03.5s), 04/10 VUs, 283 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  04.0s/50.0s

running (0m03.7s), 05/10 VUs, 523 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  05.0s/50.0s

running (0m04.7s), 06/10 VUs, 848 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  06.0s/50.0s

running (0m05.7s), 07/10 VUs, 1268 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  07.0s/50.0s

running (0m06.7s), 08/10 VUs, 1738 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  08.0s/50.0s

running (0m07.7s), 09/10 VUs, 2172 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  09.0s/50.0s

running (0m08.7s), 09/10 VUs, 2477 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  10.0s/50.0s

running (0m09.7s), 10/10 VUs, 2801 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  11.0s/50.0s

running (0m10.7s), 10/10 VUs, 3153 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  12.0s/50.0s

running (0m11.7s), 10/10 VUs, 3316 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  13.0s/50.0s

running (0m12.7s), 10/10 VUs, 3468 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  14.0s/50.0s

running (0m13.7s), 10/10 VUs, 3588 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  15.0s/50.0s

running (0m14.7s), 10/10 VUs, 3788 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  16.0s/50.0s

running (0m15.7s), 10/10 VUs, 4099 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  17.0s/50.0s

running (0m16.7s), 10/10 VUs, 4451 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  18.0s/50.0s

running (0m17.7s), 10/10 VUs, 4871 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  19.0s/50.0s

running (0m18.7s), 10/10 VUs, 5259 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  20.0s/50.0s

running (0m19.7s), 10/10 VUs, 5709 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  21.0s/50.0s

running (0m20.7s), 10/10 VUs, 6192 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  22.0s/50.0s

running (0m21.7s), 10/10 VUs, 6672 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  23.0s/50.0s

running (0m22.7s), 10/10 VUs, 7219 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  24.0s/50.0s

running (0m23.7s), 10/10 VUs, 7810 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  25.0s/50.0s

running (0m24.7s), 10/10 VUs, 8348 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  26.0s/50.0s

running (0m25.7s), 10/10 VUs, 8892 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  27.0s/50.0s

running (0m26.7s), 10/10 VUs, 9504 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  28.0s/50.0s

running (0m27.7s), 10/10 VUs, 9885 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  29.0s/50.0s

running (0m28.7s), 10/10 VUs, 10144 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  30.0s/50.0s

running (0m29.7s), 10/10 VUs, 10297 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  31.0s/50.0s

running (0m30.7s), 10/10 VUs, 10652 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  32.0s/50.0s

running (0m31.7s), 10/10 VUs, 11088 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  33.0s/50.0s

running (0m32.3s), 10/10 VUs, 11411 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  34.0s/50.0s

running (0m32.5s), 10/10 VUs, 11788 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  35.0s/50.0s

running (0m33.5s), 10/10 VUs, 12078 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  36.0s/50.0s

running (0m34.5s), 10/10 VUs, 12295 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  37.0s/50.0s

running (0m35.5s), 10/10 VUs, 12520 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  38.0s/50.0s

running (0m36.5s), 10/10 VUs, 12737 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  39.0s/50.0s

running (0m37.5s), 10/10 VUs, 12882 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  40.0s/50.0s

running (0m38.5s), 10/10 VUs, 13020 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m39.5s), 10/10 VUs, 13181 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  42.0s/50.0s

running (0m40.5s), 10/10 VUs, 13334 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  43.0s/50.0s

running (0m41.5s), 10/10 VUs, 13478 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  44.0s/50.0s

running (0m42.5s), 10/10 VUs, 13647 complete and 0 interrupted iterations
default   [  90% ] 10/10 VUs  45.0s/50.0s

running (0m43.5s), 10/10 VUs, 13802 complete and 0 interrupted iterations
default   [  92% ] 10/10 VUs  46.0s/50.0s

running (0m44.5s), 10/10 VUs, 13942 complete and 0 interrupted iterations
default   [  94% ] 10/10 VUs  47.0s/50.0s

running (0m45.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default   [  96% ] 09/10 VUs  48.0s/50.0s

running (0m46.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default   [  98% ] 09/10 VUs  49.0s/50.0s

running (0m47.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default   [ 100% ] 09/10 VUs  50.0s/50.0s

running (0m48.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m49.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m50.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m51.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m52.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m53.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m54.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m55.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m56.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m57.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (0m58.5s), 09/10 VUs, 13948 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:29Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (0m59.5s), 08/10 VUs, 13949 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:29Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"
time="2026-05-17T22:53:30Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m00.5s), 06/10 VUs, 13951 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:30Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m01.1s), 05/10 VUs, 13952 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:30Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m01.3s), 04/10 VUs, 13953 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:31Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"
time="2026-05-17T22:53:32Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m02.3s), 02/10 VUs, 13955 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:32Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m03.3s), 01/10 VUs, 13956 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s

running (1m04.3s), 01/10 VUs, 13956 complete and 0 interrupted iterations
default ↓ [ 100% ] 09/10 VUs  50s
time="2026-05-17T22:53:35Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"


  █ TOTAL RESULTS 

    checks_total.......: 13957  214.421882/s
    checks_succeeded...: 99.93% 13948 out of 13957
    checks_failed......: 0.06%  9 out of 13957

    ✗ status is 201
      ↳  99% — ✓ 13948 / ✗ 9

    HTTP
    http_req_duration..............: avg=21.59ms min=-395841869ns med=16.47ms max=639.3ms p(90)=38.81ms p(95)=51.09ms
      { expected_response:true }...: avg=21.6ms  min=-395841869ns med=16.47ms max=639.3ms p(90)=38.82ms p(95)=51.1ms 
    http_req_failed................: 0.06%  9 out of 13957
    http_reqs......................: 13957  214.421882/s

    EXECUTION
    iteration_duration.............: avg=41.39ms min=4.2ms        med=16.88ms max=30s     p(90)=39.55ms p(95)=52.15ms
    iterations.....................: 13957  214.421882/s
    vus............................: 1      min=1          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 4.1 MB 63 kB/s
    data_sent......................: 3.0 MB 46 kB/s



running (1m05.1s), 00/10 VUs, 13957 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s